a=u'''
      我知道如何變強的理由了 它引領我向前邁進
      沉醉在泥濘的走馬燈中
      變得僵硬的心 我用顫抖的手想抓住些甚麼
      就只是這樣 黑夜的氣味 凝視著天空
      能改變的只有自己而已 就只是這樣
      我知道如何變強的理由了 它引領我向前邁進
      無論如何 仍有無法抹滅的夢 仍有無法停止的當下
      但若我能為了誰而變得強大
      無論幾次我都會站起來
      被世界狠狠打擊 我明白失敗的意義
      紅蓮之花阿  綻放吧
      照亮命運吧
   '''
tone='''
 5 4.5 5 * 5 4.5 5 * -5 5 4.5 3 2 2 * -7 2 3 * 3 5 6 * 5 6 7 * 
 3 5 4.5 2 3 2 * -6 -5 -5 -6 1 -7 -3 * 
 -3 -5 -6 -7 -6 -7 2 3 5 4.5 * 2 3 2 3 3 3 7 6 7 6 7 +1 7 5 * 
 5 4.5 4.5 5 6 * 5 6 5 3 5 7 6 * 5 6 5 3 5 +2 * 
 5 6 5 3 5 7 6 * 6 7 6 7 +2 7 6 5 * 5 4.5 4.5 5 6 * 
 5 4.5 5 * 5 4.5 5 * -5 5 4.5 3 2 2 * -7 2 3 * 3 5 6 * 5 6 7 
 2 2 7 6 7 +2 7 6 7 7 * 5 6 7 +2 7 6 7 7 * 
 2 2 5 5 2 2 5 6 5 +2 +1 7 6 5 5 * 
 5 6 7 6 * 2.5 6 7 +2 7 * 
 2 2 7 6 7 +2 7 6 7 7 * 5 5 6 7 +2 7 6 7 5 * 
 5 5 6 7 7 +5 +4.5 +2 7 6 5 5 * 
 5 6 7 6 * 2 2 * 3 * 
'''

a=a.split('\n')
beat='''
 8 6 20 4 8 6 16 4 6 8 6 16 4 20 4 8 4 20 2 8 4 20 2 8 4 32 32 
 8 6 8 4 4 16 4 4 2 2 4 4 6 24 4 
 4 2 4 6 4 4 4 6 6 6 2 4 4 12 4 2 2 2 2 2 2 4 4 6 20 4 
 8 6 6 4 8 4 8 6 6 6 6 8 12 8 4 6 6 6 6 20 16 
 4 6 6 6 6 6 6 8 4 4 4 4 4 4 6 10 2 4 6 6 4 8 4 
 8 6 20 4 8 6 16 4 4 6 6 16 4 20 4 8 4 16 4 8 4 16 4 8 4 32 
 8 8 8 4 4 4 4 4 2 2 4 4 4 4 4 4 4 2 2 4 
 4 4 2 6 4 4 4 4 4 8 8 6 6 4 8 4 
 8 4 4 4 8 4 8 4 4 32 8 
 8 8 8 4 4 4 4 4 2 2 4 2 2 4 4 4 4 4 2 2 4 
 4 6 6 8 4 4 12 8 6 6 4 6 8 
 8 4 4 16 4 4 4 2 8 50 
'''
vec=[]
tone=tone.split(' ')
beat=beat.split(' ')
print(beat)
print(tone)
for i in tone:
    arg=0
    if len(i)==2 or len(i)==4:
        if i[0]=='-':
            i=i[1:]
            arg-=14
        elif i[0]=='+':
            arg+=14
            i=i[1:]
    if i=='\n':
        pass
        print()
    elif i=='*':
        print('%2d'%0,end=',')
        #print('%2d'%0,end=',|')
        vec.append(i)
    else:
        i=eval(i)
        i=int(14+2*i+arg-1)
        #print('%2d'%i,end=',|')
        print('%2d'%i,end=',')
        vec.append(i)
k=0
for i in tone:
    
    if i=='\n':
        print()
    if(k<len(beat)):
        if not beat[k]=='\n':
           # print("%2d"%eval(beat[k]),end=',|')
            print("%2d"%eval(beat[k]),end=',')
    else:
        if not i=='\n':
            #print("%2d"%4,end=',|')
            print("%2d"%4,end=',')
    k+=1;
    
print()
print(len(vec)-1)